Table of Contents
 Class CheckResConcreteBlock
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Check value for Concrete Block
[Serializable]
[DataContract]
public class CheckResConcreteBlock
Inheritance
object
CheckResConcreteBlock
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckStatus
Status of the Check
[DataMember]
public bool CheckStatus { get; set; }
Property Value
bool
 LoadCaseId
Id of Load Case
[DataMember]
public int LoadCaseId { get; set; }
Property Value
int
 Name
Name of Concrete Block
[DataMember]
public string Name { get; set; }
Property Value
string
 UnityCheck
Unity Check
[DataMember]
public double UnityCheck { get; set; }
Property Value
double
 Edit this page